Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/editor-omegat.tmx
Source language: en_us
Languages: pt_br

source: Show glyph margin even when there are no annotations.
pt_br: Exibir margem do ícone mesmo que não exista anotações.

source: Incremental Search Forward
pt_br: Encaminhar pesquisa incremental

source: Incremental Search Backward
pt_br: Pesquisa incremental para trás

source: Close Incremental Search Sidebar
pt_br: Fechar barra lateral da pesquisa incremental

source: Find:
pt_br: Localizar:

source: Incrementally Search Text (ENTER - Find Next, Shift+ENTER - Find Previous)
pt_br: Pesquisa de texto incremental (ENTER - Procurar próximo, Shift+ENTER - Procurar anterior)

source: &Next
pt_br: Próxi&mo

source: &Previous
pt_br: Anterio&r

source: Match &Case
pt_br: &Coincidir maiúsculas e minúsculas

source: Whole &Words
pt_br: Palavras &inteiras

source: &Regular Expression
pt_br: Expressão &regular

source: &Highlight Results
pt_br: Resultados r&ealçados

source: Go back to {0}
pt_br: Volta para {0}

source: Back
pt_br: Voltar

source: Go forward to {0}
pt_br: Avançar para {0}

source: Forward
pt_br: Avançar

source: Go to last edit in {0}
pt_br: Ir para última edição em {0}

source: Last edit
pt_br: Última edição

source: Last Edit Location
pt_br: Local da última edição

source: Mo&ve Up
pt_br: Mo&ver para cima

source: Move Do&wn
pt_br: Mover para bai&xo

source: Dup&licate Up
pt_br: Dup&licar para cima

source: Duplic&ate Down
pt_br: Duplic&ar para baixo

source: Contains plain text editor implementation
pt_br: Contém implementações para o editor de texto simples

source: Plain Editor contains editing support for plain text files
pt_br: Editor simples contém suporte para a edição de arquivos de texto simples

source: Plain Editor Library
pt_br: Biblioteca do editor simples

source: Contains plain editor library implementation
pt_br: Contém a implementação da biblioteca do editor simples

source: Plain Editor Library contains editing support for plain text files that can be used in standalone editor
pt_br: Biblioteca do editor simples contém suporte para arquivos texto simples que podem ser utilizados em um editor autônomo

source: For the list of included fixed bugs please check <A HREF="http://wiki.netbeans.org/wiki/view/NetBeans6.0PatchesInfo">http://wiki.netbeans.org/wiki/view/NetBeans6.0PatchesInfo</A>.
pt_br: Para a lista dos bus corrigidos favor verificar <A HREF="http://wiki.netbeans.org/wiki/view/NetBeans6.0PatchesInfo">http://wiki.netbeans.org/wiki/view/NetBeans6.0PatchesInfo</A>.

source: <BR> <BR> Editing support or various types of files: bat, diff, manifest, sh, css, html, images, Java Script, properties files, xml, etc.
pt_br: <BR> <BR> Suporta edição ou vários tipos de arquivos: bat, diff, manifest, sh, css, html, images, Java Script, properties files, xml, etc.

source: Also contains various editor features, such as go to file, bookmarks, templates, error stripe, etc.
pt_br: Também contém várias características do editor como, ir para arquivo, marcador, modelos, lista de erros, etc.

source: Editing Files
pt_br: Edição de arquivos

source: Editting support for various types of files.
pt_br: Suporte à edição de vários tipos de arquivos.

source: Editor Code Templates
pt_br: Editor de modelos de código

source: Contains support for creation and using of code templates
pt_br: Contém suporte para a criação e uso de modelos de código

source: Editor Code Templates module allows to paste existing code templates into the editor text and create additional templates
pt_br: O Módulo de Modelos de Código do Editor permite colar modelos de código existente dentro do texto do editor e criar modelos adicionais

source: Surround with ...
pt_br: Circundar com ...

source: <html>Surround with
pt_br: <html> Circundar com ...

source: Abbreviation: &nbsp;<b>{0}</b>&nbsp; [{1} for expansion]
pt_br: Abreviação: &nbsp;<b>{0}</b>&nbsp; [{1} para expansão]

source: Editor Library 2
pt_br: Biblioteca do editor 2

source: Contains core editor APIs and SPIs.
pt_br: Contém editor núcleo de APIs e SPIs.

source: The library includes implementations of the text document, view hierarchy and highlighting.
pt_br: A biblioteca inclue implementação do texto do documento, exibir hierarquia e realçe.

source: The library is independent on the NetBeans IDE.
pt_br: A biblioteca é independente do NetBeans IDE.

source: Wrong position
pt_br: Posição errada

source: found at
pt_br: encontrado em

source: not found
pt_br: não encontrado

source: End of the document reached.
pt_br: Fim do documento alcançado.

source: Continuing search from beginning.
pt_br: Continuando pesquisa do início.

source: Beginning of the document reached.
pt_br: Início do documento alcançado.

source: Continuing search from end.
pt_br: Continuando pesquisa do final.

source: End of the selection reached.
pt_br: Fim da seleção encontrada.

source: Beginning of the selection reached.
pt_br: Início da seleção encontrada.

source: {0} of {1} items replaced
pt_br: {0} de {1} ítens substituídos

source: Regular Expression Error
pt_br: Erro de expressão regular

source: Find What:
pt_br: Localizar:

source: Replace With:
pt_br: Substituir:

source: Highlight Results
pt_br: Resultados realçados

source: Highlights all occurrences of the searched text.
pt_br: Realçar todas ocorrências do texto pesquisado.

source: Tries to find text as you type.
pt_br: Tenta encontrar o texto enquanto você digita.

source: Match Case
pt_br: Coincidir &maiúsculas e minúsculas

source: Search the document only for text with the same capitalization.
pt_br: Pesquisar o documento somente para textos com a mesma inicial maiúscula.

source: Smart Case
pt_br: Maiúscula/minúscula inteligente

source: Matches case if at least one character in the searched text is uppercase.
pt_br: Combina maiúscula/minúscula se ao menos um caracter no texto pesquisado for maiúscula.

source: Whole Words
pt_br: Palavras inteiras

source: Matches the searched text only to whole words in the document.
pt_br: Combina o texto pesquisado somente para palavras inteiras no documento.

source: Search Backwards
pt_br: Pesquisa para trás

source: Searches backwards from the current cursor position.
pt_br: Pesquisa para trás da posição atual do cursor.

source: Wrap Around
pt_br: Circular

source: Continues search from the beginning if end of the document is reached.
pt_br: Continua pesquisa do início se o fim do documento for alcançado.

source: Regular Expressions
pt_br: Expressões regulares

source: Uses regular expressions to search the document.
pt_br: Utiliza expressões regulares ao pesquisar no documento.

source: Searches for occurrences in a selected block of text only.
pt_br: Procurar por ocorrências apenas no texto do bloco selecionado.

source: Find
pt_br: Localizar

source: Replace
pt_br: Substituir

source: Replace All
pt_br: Substituir tudo

source: Close
pt_br: Fechar

source: Editor Guarded Sections
pt_br: Editor de chaves correspondente

source: Provides support for manipulating garded sections in a document.
pt_br: Fornece suporte para manipulação das seções protegidas no documento.

source: The module allows clients to manipulate named guarded sections of a document that prevent user modifications of the document's content inside those sections.
pt_br: O módulo permite aos clientes manipular as chamadas seções protegidas de um documento que previne a modificação por usuários, do conteúdo do documento dentro das seções.

source: Annotations Cycling
pt_br: Ciclo das anotações

source: Debug Filename and Line Number
pt_br: Arquivo e número da linha do depurador

source: Expand Abbreviation
pt_br: Expandir abreviação

source: Reset Abbreviation
pt_br: Redefinir abreviação

source: Toggle Breakpoint
pt_br: Alternar ponto de interrupção

source: New Watch...
pt_br: Novo observador...

source: Move Insertion Point to Bottom
pt_br: Mover ponto de inserção para baixo

source: Move Insertion Point to Center
pt_br: Mover ponto de inserção ao centro

source: Move Insertion Point to Top
pt_br: Mover ponto de inserção para cima

source: Scroll Insertion Point to Bottom
pt_br: Rolar ponto de inserção para baixo

source: Scroll Insertion Point to Center
pt_br: Rolar ponto de inserção ao centro

source: Scroll Insertion Point to Top
pt_br: Rolar ponto de inserção para cima

source: Beep
pt_br: Aviso sonoro

source: Select Code Between Braces
pt_br: Selecionar código entre chaves

source: Match Bracket
pt_br: Parênteses correspondentes

source: Build Popup Menu
pt_br: Construir menu pop-up

source: Dump View Hierarchy
pt_br: Despejar hierarquia de exibição

source: Co&llapse All
pt_br: Reco&lher todos

source: &Collapse Fold
pt_br: Re&colher dobramento

source: E&xpand All
pt_br: E&xpandir todos

source: &Expand Fold
pt_br: &Expandir dobramento

source: Collapse All
pt_br: Reco&lher todos

source: Collapse Fold
pt_br: Re&colher dobramento

source: Expand All
pt_br: E&xpandir todos

source: Expand Fold
pt_br: &Expandir dobramento

source: Build Tool Tip
pt_br: Construir dica

source: Insertion Point Backward
pt_br: Ponto de inserção para trás

source: Insertion Point to Beginning of Text on Line
pt_br: Ponto de inserção para início do texto na linha

source: Insertion Point to Beginning of Line
pt_br: Ponto de inserção para início da linha

source: Insertion Point to Beginning of Word
pt_br: Ponto de inserção para início da palavra

source: Insertion Point to Beginning of Document
pt_br: Ponto de inserção para início do documento

source: Insertion Point Down
pt_br: Ponto de inserção para baixo

source: Insertion Point to End of Line
pt_br: Ponto de inserção para fim da linha

source: Insertion Point to End of Word
pt_br: Ponto de inserção para fim da palavra

source: Insertion Point to End of Document
pt_br: Ponto de inserção para fim do documento

source: Insertion Point Forward
pt_br: Ponto de inserção para frente

source: Insertion Point to Next Word
pt_br: Ponto de inserção para próxima palavra

source: Insertion Point to Previous Word
pt_br: Ponto de inserção palavra anterior

source: Insertion Point Up
pt_br: Ponto de inserção para cima

source: Copy
pt_br: Copiar

source: Cut
pt_br: Recortar

source: Cut from Insertion Point to Line Begining
pt_br: Recortar do ponto de inserção para início da linha

source: Cut from Insertion Point to Line End
pt_br: Recortar do ponto de inserção para fim da linha

source: Default Typed
pt_br: Padrão Tipado

source: Delete Next Character
pt_br: Excluir próximo caracter

source: Delete Previous Character
pt_br: Excluir caracter anterior

source: Simulate Escape Key
pt_br: Simular tecla escape

source: Fast Import
pt_br: Importação rápida

source: Surround With try-catch
pt_br: Circundar com try-catch

source: Find Next Occurrence
pt_br: Localizar próxima ocorrência

source: Find Previous Occurrence
pt_br: Localizar ocorrência anterior

source: Find Selection
pt_br: Localizar &seleção

source: Go to First Non-whitespace Char
pt_br: Ir para primeiro caracter desconsiderando espaço em branco

source: Format
pt_br: &Formatar

source: Go to Declaration
pt_br: Ir para &declaração

source: Go to Help
pt_br: Ir para ajuda

source: Go to Source
pt_br: Ir para o &código

source: Go to Super Implementation
pt_br: Ir para super &implementação

source: Go to Line...
pt_br: Ir para linha...

source: Line...
pt_br: Linha...

source: Start New Line
pt_br: Iniciar nova linha

source: Insert Newline
pt_br: Inserir nova linha

source: Insert Content
pt_br: Inserir conteúdo

source: Insert Current Date and Time
pt_br: Inserir data e hora atual

source: Insert Tab
pt_br: Inserir tabulação

source: Jump to Next Edit Cross Window
pt_br: Pular para editar próxima janela transversal

source: Jump to Previous Edit Cross Window
pt_br: Pular para editar janela transversal anterior

source: Go to Last Non-whitespace Char
pt_br: Ir para último caracter desconsiderando espaço em branco

source: Replace Variable With its Getter
pt_br: Substituir variável com seu getter

source: Replace Variable With its is* Method
pt_br: Substituir variável com seu método is*

source: Replace Variable With its Setter
pt_br: Substituir variável com seu setter

source: Match Brace
pt_br: Chave correspondente

source: Page Down
pt_br: Página abaixo

source: Page Up
pt_br: Página acima

source: Paste Formatted
pt_br: Colar f&ormatado

source: Paste
pt_br: Colar

source: Delete
pt_br: Excluir

source: Redo
pt_br: Refazer

source: Re-indent Current Line or Selection
pt_br: Reindentar linha ou seleção atual

source: Delete Line
pt_br: Excluir linha

source: Move Selection else Line up
pt_br: Mover seleção para outra linha acima

source: Move Selection else Line down
pt_br: Mover seleção para outra linha abaixo

source: Copy Selection else Line up
pt_br: Copiar seleção para outra linha acima

source: Copy Selection else Line down
pt_br: Copiar seleção para outra linha abaixo

source: Delete Preceding Characters in Line
pt_br: Excluir Caracteres Precedentes na Linha

source: Delete Selection
pt_br: Excluir Seleção

source: Delete Tab
pt_br: Excluir Tabulação

source: Remove Trailing Spaces
pt_br: Remover espaços em brancos posteriores

source: Delete Previous Word
pt_br: Excluir palavra anterior

source: Delete Next Word
pt_br: Excluir próxima palavra

source: Scroll to Bottom
pt_br: Rolar para o final

source: Scroll to Center
pt_br: Rolar para o centro

source: Scroll Down
pt_br: Rolar para baixo

source: Scroll to Top
pt_br: Rolar para o início

source: Scroll Up
pt_br: Rolar para cima

source: Select All
pt_br: Selecionar &tudo

source: Select Identifier
pt_br: Selecionar identificador

source: Select Line
pt_br: Selecionar linha

source: Select Next Parameter
pt_br: Selecionar próximo parâmetro

source: Select Word
pt_br: Selecionar palavra

source: Extend Selection Backward
pt_br: Extender seleção para trás

source: Extend Selection to Beginning of Text on Line
pt_br: Extender seleção para início do texto na linha

source: Extend Selection to Beginning of Line
pt_br: Extender seleção para início da linha

source: Extend Selection to Beginning of Word
pt_br: Extender seleção para início da palavra

source: Extend Selection to Beginning of Document
pt_br: Extender seleção para início do documento

source: Extend Selection to Matching Bracket
pt_br: Extender seleção para parênteses combinados

source: Extend Selection Down
pt_br: Extender seleção para baixo

source: Extend Selection to End of Line
pt_br: Extender seleção para final da linha

source: Extend Selection to End of Word
pt_br: Extender seleção para final da palavra

source: Extend Selection to End of Document
pt_br: Extender seleção para final do documento

source: Extend Selection to First Non-whitespace Char
pt_br: Extender seleção para primeiro caracter desconsiderando espaço em branco

source: Extend Selection Forward
pt_br: Extender seleção para frente

source: Extend Selection to Last Non-whitespace Char
pt_br: Extender seleção para último caracter desconsiderando espaço em branco

source: Extend Selection to Matching Brace
pt_br: Extender seleção para chaves correspondente

source: Extend Selection to Next Word
pt_br: Extender seleção para próxima palavra

source: Extend Selection to Next Page
pt_br: Extender seleção para próxima página

source: Extend Selection to Previous Page
pt_br: Extender seleção para página anterior

source: Extend Selection Back
pt_br: Extender seleção de volta

source: Extend Selection Up
pt_br: Extender seleção para cima

source: Set Dot
pt_br: Definir ponto

source: Set Read Only
pt_br: Definir somente leitura

source: Set Writable
pt_br: Definir escrita

source: Substitute Code Completion Text
pt_br: Texto substituto do auto-completar de código

source: Shift Line Left
pt_br: Deslocar linha à esquerda

source: Shift Line Right
pt_br: Deslocar linha à direita

source: Show Code Completion Popup
pt_br: Exibir pop-up de auto-completar de código

source: Show All Code Completion Popup
pt_br: Exibir todas pop-ups de auto-completar de código

source: Show Smart Code Completion Popup
pt_br: Exibir pequena pop-up de auto-completar de código

source: Show Documentation Popup
pt_br: Exibir pop-up da documentação

source: Show Popup Menu
pt_br: Exibir menu de pop-up

source: Show Code Completion Tip Popup
pt_br: Exibir pop-up de dica de auto-completar de código

source: Split Line
pt_br: Dividir linha

source: Start Macro Recording
pt_br: Iniciar gravação da &macro

source: Stop Macro Recording
pt_br: Parar gravaçã&o da macro

source: Switch Case
pt_br: Alternar &maiúscula/minúscula

source: To Lowercase
pt_br: Para minúsculas

source: To Uppercase
pt_br: Para maiúsculas

source: Switch Capitalization of Identifier
pt_br: Alternar iniciais do identificador

source: Switch Capitalization of Word
pt_br: Altenar iniciais da palavra

source: Toggle Highlight Search
pt_br: Alternar destaque da pesquisa

source: Toggle Line Numbers
pt_br: Alternar número das linhas

source: Toggle Toolbar
pt_br: Alternar barra de ferramentas

source: Toggle Typing Mode
pt_br: Alternar modo de digitação

source: Uncomment
pt_br: &Não comentado

source: Undo
pt_br: Desfazer

source: Unselect
pt_br: Não-selecionar

source: Next Matching Word
pt_br: Próxima palavra correspondente

source: Previous Matching Word
pt_br: Palavra anterior correspondente

source: Trailing spaces were removed.
pt_br: Espaços em branco posteriores foram removidos.

source: Recording
pt_br: Gravando

source: Recorded Macro
pt_br: Macro gravada

source: Cancel
pt_br: Cancelar

source: Warning
pt_br: Aviso

source: Empty name of macro not allowed!
pt_br: Não é permitido nome vazio para macros!

source: Name:
pt_br: Nome:

source: Add a keybinding for this macro
pt_br: Adiocionar atalhos para esta macro

source: Remove a keybinding from this macro
pt_br: Remover atalhos desta macro

source: This shortcut sequence is already bound to this Macro.
pt_br: Esta sequência de atalho já está associada à esta Macro.

source: Go To Line:
pt_br: Ir para linha:

source: Go To Line
pt_br: Ir para linha

source: Go To
pt_br: Ir para

source: Insert Mode
pt_br: Modo de inserção

source: Overwrite Mode
pt_br: Modo substituição

source: Caret Position
pt_br: Posição do cursor

source: Attempt to insert into guarded block at position {0}.
pt_br: Tentativa de inserção em bloco protegido na posição {0}.

source: Attempt to remove from guarded block at position {0}.
pt_br: Tentativa de remoção em bloco protegido na posição {0}.

source: Multiple annotations here [{0}] - click to cycle
pt_br: Múltiplas anotações aqui [{0}] - clique para ciclo

source: Glyph Gutter
pt_br: Barra de ícone

source: Component for displaying line numbers and annotation glyphs
pt_br: Componente para exibir número das linhas e ícones de anotações

source: Show Line Numbers
pt_br: Exibir número das linhas

source: Code Completion
pt_br: Auto-completar de código

source: Code Completion Window
pt_br: Janela de auto-completar de código

source: Please Wait...
pt_br: Aguarde...

source: No Matching Item Found
pt_br: Nenhum item correspondente encontrado

source: Searching...
pt_br: Pesquisando...

source: Parameters:
pt_br: Parâmetros:

source: See Also:
pt_br: Veja também:

source: Throws:
pt_br: Excessões:

source: Returns:
pt_br: Retornos:

source: Since:
pt_br: Desde:

source: Author:
pt_br: Autor:

source: Deprecated:
pt_br: Obsoleto:

source: Version:
pt_br: Versão:

source: Please wait...
pt_br: Aguarde...

source: Code folding side bar shows text folds and allows their collapsing and expanding.
pt_br: Barra lateral de dobramento de código exibe dobramentos de texto e o permite recolher e expandir.

source: Invoking {4} implemented as {3} thru {1}
pt_br: Invocando {4} implementado como {3} através {1}

source: Toggle Comment
pt_br: Alternar comentário

source: Editor Library
pt_br: Biblioteca do editor

source: Contains Editor functionality independent on the IDE
pt_br: Contém funcionalidade do editor independente no IDE

source: Editor Library contains editor functionality generally independent on the NetBeans IDE.
pt_br: A Biblioteca do editor contém funcionalidade geralmente independente no IDE NetBeans.

source: It can be reused for standalone editors.
pt_br: Pode ser reutilizado para editores autônomos.

source: Editor Indentation
pt_br: Editor de indentação

source: Contains indentation APIs and SPIs.
pt_br: Contém indentação de APIs e SPIs.

source: The module includes indentation and code formatting APIs and infrastructure.
pt_br: O módulo inclui APIs de indentação e formatação de código, e infra-estrutura.

source: Contains support for editor settings
pt_br: Contém suporte para configurações do editor

source: Editor Settings module contains support for retrieving settings of various editor kits.
pt_br: O módulo configurações do editor contém suporte para recuperar configurações de vários kits do editor.

source: Editor Settings Storage
pt_br: Editor de configurações de armazenamento

source: Implements Netbeans editor settings storage
pt_br: Implementações do editor de configurações de armazenamento do NetBeans

source: Implements storage for Netbeans editor settings and defines the structure of editor setting files.
pt_br: Implementações de armazenamento para o editor de configurações do Netbeans e definição da estrutura dos arquivos de configurações do editor.

source: It also provides friend API for modules that need read/write access to the storage.
pt_br: Este também implementa uma API amigável para módulos que precisem o acesso à Leitura/Escrita para o armazenamento.

source: NetBeans Editor Settings Files
pt_br: Arquivos de configuração do editor do NetBeans

source: Editor Code Completion
pt_br: Editor de auto-completar de código

source: Contains support for Code Completion in Editor
pt_br: Contém suporte para auto-completar de código no editor

source: Code Completion is a submodule of Editor containing API, SPI and infrastructure for Code Completion./ The module is generic and can be used with any Swing based editor/
pt_br: Auto-completar de código é um submódulo do editor que contém API, SPI e infraestrutura para auto-completar de código/ Este módulo é generico e pode ser usado com qualquer editor baseado em Swing.

source: No suggestions
pt_br: Sem sugestões

source: Go to previous page
pt_br: Ir para a página anterior

source: Go to next page
pt_br: Ir para a próxima página

source: Show documentation in external web browser
pt_br: Exibir documentação no navegador web externo

source: Open source in editor
pt_br: Abrir código-fonte no editor

source: Imported Items; Press {0} Again for All Items
pt_br: Itens importados; Pressione {0} novamente para todos os itens

source: Completion invoked/ Explicit: {0}
pt_br: Auto-completar invocado/ Explícito: {0}

source: Completion key selection {0} of index {1} implemented as {2}
pt_br: Auto-completar seleção da tecla {0} do índice {1} implementado como {2}

source: Completion default selection of index {1} implemented as {2}
pt_br: Auto-completar a seleção padrão do índice {1} implementado como {2}

source: Completion mouse selection of index {1} implemented as {2}
pt_br: Auto-completar seleção do mouse do índice {1} implementado como {2}

source: Completion cancelled
pt_br: Auto-completar cancelado

source: Complete &Code...
pt_br: Completar &código...

source: Show &Documentation
pt_br: Exibir &documentação

source: &Show Method Parameters
pt_br: Exibir parâmetro&s dos métodos

source: Press Alt-Enter
pt_br: Pressione Alt-Enter

source: Fi&x Code...
pt_br: Co&rrigir código...

source: Hint invoked: {0}
pt_br: Dica chamada: {0}

source: No fixable error.
pt_br: Erro não corrigível.

source: Cannot apply fix in a guarded block
pt_br: Não é possível aplicar a correção no bloco protegido

source: Editor Hints (Experimental)
pt_br: Dicas no editor (Experimental)

source: Editor Hints Infrastructure
pt_br: Infra-estrutura de dicas no editor
